# pandas 연습장
데이터 분석을 위한 기본적인 pandas 예제를 알아봅시다.

## 1. pandas 사용하기
소스코드 최상단에 아래와 같이 입력합니다. 보통 pd를 약자로 사용합니다.

In [2]:
import pandas as pd
import numpy as np

## 2. 파일 불러오기/ 저장하기
- pandas는 csv, excel, html, spl 소스에서 데이터를 읽어오는 함수를 제공
1. CSV : pd.read_csv() / pd.to_csv()
2. EXCEL : pd.read_excel() / pd.to_excel()
3. HTML : pd. read_html() / pd.to_html()
4. SQL : pd.read_spl() / pd.to_spl()

### CSV

In [4]:
df = pd.read_csv('./example_1.csv')#./ 같은 csv 파일이 같은 경로에 있다는 뜻
df

    a   b   c   d  e
0   1   2   3   4  1
1   5   6   7   8  0
2   9  10  11  12  1
3  13  14  15  16  0

In [10]:
df.to_csv('example_1_False.csv', index=False) # 이거로 저장해야함

In [11]:
df.to_csv('example_1_True.csv', index=True)

### Excel

In [16]:
df2 = pd.read_excel('example_2.xlsx')

In [18]:
df2.to_excel('example_2_False.xlsx', index=False)

### HTML

In [22]:
df = pd. read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [26]:
df[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [27]:
df[0] ['Bank NameBank']

0                      Almena State Bank
1             First City Bank of Florida
2                   The First State Bank
3                     Ericson State Bank
4       City National Bank of New Jersey
                     ...
558                   Superior Bank, FSB
559                  Malta National Bank
560      First Alliance Bank & Trust Co.
561    National State Bank of Metropolis
562                     Bank of Honolulu
Name: Bank NameBank, Length: 563, dtype: object

## 3. pandas 자료형

pandas의 대표적인 자료형에는 Series와 DataFrame이 있음
각 자료형의 특성과 활용 예시를 살펴봅시다.

1. Series: Numpy 배열과 유사. 축(axis)정보를 사용할 수 있다는 점에서 다름
2. DataFrame: 행과 열 이름이 있는 2차원 자료형

In [28]:
list_var = ['a','b','c','d']
list_var

['a', 'b', 'c', 'd']

In [29]:
type(list_var)

list

In [30]:
series_var = pd.Series(list_var, index=[2,1,3,0]) #인덱스 부여
series_var

2    a
1    b
3    c
0    d
dtype: object

### Series 생성
1. 리스트를 Series로 변환하거나
2. 사전(dictionary)을 Series로 변환할 수 있음

In [33]:
idx = ['a','b','c']
lst = [10,20,30]

In [32]:
pd.Series(data=lst)

0    10
1    20
2    30
dtype: int64

In [34]:
pd.Series(data=idx)

0    a
1    b
2    c
dtype: object

In [35]:
pd.Series(data=lst, index=idx)

a    10
b    20
c    30
dtype: int64

In [37]:
dic = {'a':10, 'b':20, 'c':30}
dic

{'a': 10, 'b': 20, 'c': 30}

In [38]:
type(dic) #자료형의 한 종류 ex 문자형, 리스트 등

dict

In [39]:
dic['c']

30

In [41]:
ser = pd.Series(data=dic)
ser

a    10
b    20
c    30
dtype: int64

In [42]:
ser['a']

10

## 4. DataFrame
1. DataFrame = Series + Series + ....+ Series
2. 거의 모든 데이터 처리에 DataFrame 사용
3. 데이터프레임 정보 보기 : head(), shape()
4. 특정요소에 접근하기
5. 데이터프레임 쪼개고 합치기
6. 누락 데이터 처리하기

### 1) DataFrame 생성

In [44]:
df = pd.DataFrame(np.random.rand(5,5)) #random한 수를 rand 정규분포 따르도록 가져옴
df

          0         1         2         3         4
0  0.200554  0.635347  0.347712  0.712952  0.398546
1  0.423288  0.155605  0.929943  0.806736  0.514152
2  0.084381  0.619605  0.235326  0.645894  0.504643
3  0.664172  0.802043  0.637470  0.029915  0.436595
4  0.699811  0.901507  0.069114  0.819202  0.876346

In [48]:
df = pd.DataFrame(np.random.randn(5,5), index = ['A','B','C','D','E'], columns = ['V','W','X','Y','Z']) #인덱스 행 나타냄
df

          V         W         X         Y         Z
A -0.601560 -0.707353 -2.868457  0.453342 -0.663943
B -0.709159 -0.416313  0.552630  0.323735  0.868555
C  1.113598  0.484620  1.198173 -0.663243 -0.117521
D -1.717568  1.865648  0.141959 -0.385196 -1.311474
E  2.008723  0.049734  0.029105  0.832876  0.733554

### 2) 데이터프레임 살펴보기

In [49]:
df.shape #행렬 몇개인지 알려줌 (사이즈)

(5, 5)

In [50]:
df.columns

Index(['V', 'W', 'X', 'Y', 'Z'], dtype='object')

In [51]:
df.head() #양이 많을 때 일부만 5개 출력해서 보여줌

          V         W         X         Y         Z
A -0.601560 -0.707353 -2.868457  0.453342 -0.663943
B -0.709159 -0.416313  0.552630  0.323735  0.868555
C  1.113598  0.484620  1.198173 -0.663243 -0.117521
D -1.717568  1.865648  0.141959 -0.385196 -1.311474
E  2.008723  0.049734  0.029105  0.832876  0.733554

In [52]:
df.info() #데이터프레임 정보

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   V       5 non-null      float64
 1   W       5 non-null      float64
 2   X       5 non-null      float64
 3   Y       5 non-null      float64
 4   Z       5 non-null      float64
dtypes: float64(5)
memory usage: 240.0+ bytes

In [53]:
df.describe()

              V         W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.018807  0.255267 -0.189318  0.112303 -0.098166
std    1.507325  1.008195  1.566114  0.618307  0.924514
min   -1.717568 -0.707353 -2.868457 -0.663243 -1.311474
25%   -0.709159 -0.416313  0.029105 -0.385196 -0.663943
50%   -0.601560  0.049734  0.141959  0.323735 -0.117521
75%    1.113598  0.484620  0.552630  0.453342  0.733554
max    2.008723  1.865648  1.198173  0.832876  0.868555

### 3) DataFrame 접근

In [54]:
df

          V         W         X         Y         Z
A -0.601560 -0.707353 -2.868457  0.453342 -0.663943
B -0.709159 -0.416313  0.552630  0.323735  0.868555
C  1.113598  0.484620  1.198173 -0.663243 -0.117521
D -1.717568  1.865648  0.141959 -0.385196 -1.311474
E  2.008723  0.049734  0.029105  0.832876  0.733554

In [56]:
df['V']

A   -0.601560
B   -0.709159
C    1.113598
D   -1.717568
E    2.008723
Name: V, dtype: float64

In [59]:
df[['V','W','X']]

          V         W         X
A -0.601560 -0.707353 -2.868457
B -0.709159 -0.416313  0.552630
C  1.113598  0.484620  1.198173
D -1.717568  1.865648  0.141959
E  2.008723  0.049734  0.029105

In [60]:
df > -1

       V     W      X     Y      Z
A   True  True  False  True   True
B   True  True   True  True   True
C   True  True   True  True   True
D  False  True   True  True  False
E   True  True   True  True   True

In [61]:
df

          V         W         X         Y         Z
A -0.601560 -0.707353 -2.868457  0.453342 -0.663943
B -0.709159 -0.416313  0.552630  0.323735  0.868555
C  1.113598  0.484620  1.198173 -0.663243 -0.117521
D -1.717568  1.865648  0.141959 -0.385196 -1.311474
E  2.008723  0.049734  0.029105  0.832876  0.733554

In [62]:
df[df>-1]

          V         W         X         Y         Z
A -0.601560 -0.707353       NaN  0.453342 -0.663943
B -0.709159 -0.416313  0.552630  0.323735  0.868555
C  1.113598  0.484620  1.198173 -0.663243 -0.117521
D       NaN  1.865648  0.141959 -0.385196       NaN
E  2.008723  0.049734  0.029105  0.832876  0.733554

In [64]:
df_nan = df[df > -1]
df_nan

          V         W         X         Y         Z
A -0.601560 -0.707353       NaN  0.453342 -0.663943
B -0.709159 -0.416313  0.552630  0.323735  0.868555
C  1.113598  0.484620  1.198173 -0.663243 -0.117521
D       NaN  1.865648  0.141959 -0.385196       NaN
E  2.008723  0.049734  0.029105  0.832876  0.733554

In [68]:
df['W']

A   -0.707353
B   -0.416313
C    0.484620
D    1.865648
E    0.049734
Name: W, dtype: float64

In [70]:
df['W'] > 0

A    False
B    False
C     True
D     True
E     True
Name: W, dtype: bool

In [67]:
df[df['W'] > 0] #False인 열 버려짐

          V         W         X         Y         Z
C  1.113598  0.484620  1.198173 -0.663243 -0.117521
D -1.717568  1.865648  0.141959 -0.385196 -1.311474
E  2.008723  0.049734  0.029105  0.832876  0.733554

In [71]:
df[(df['W'] > 0) & (df['V'] > 0)]

          V         W         X         Y         Z
C  1.113598  0.484620  1.198173 -0.663243 -0.117521
E  2.008723  0.049734  0.029105  0.832876  0.733554

### 4) DataFrame  Row 접근
1. loc: 라벨값 기반의 2차원 인덱싱
2. iloc : 순서를 나타내는 정수 기반의 2차원 인덱싱

In [72]:
df = pd.read_csv('example_1.csv')
df

    a   b   c   d  e
0   1   2   3   4  1
1   5   6   7   8  0
2   9  10  11  12  1
3  13  14  15  16  0

In [73]:
df.loc[0] #0번째 행 뽑아짐

a    1
b    2
c    3
d    4
e    1
Name: 0, dtype: int64

In [75]:
df['a'] #a 열 뽑아짐

0     1
1     5
2     9
3    13
Name: a, dtype: int64

In [77]:
df.loc[df['e'] > 0, : ]

   a   b   c   d  e
0  1   2   3   4  1
2  9  10  11  12  1

In [78]:
df

    a   b   c   d  e
0   1   2   3   4  1
1   5   6   7   8  0
2   9  10  11  12  1
3  13  14  15  16  0

In [79]:
df.iloc[0] #지금은 인덱스가 0123 똑같아서 똑같이 출력/ 데이터를 행 단위로 가져옴

a    1
b    2
c    3
d    4
e    1
Name: 0, dtype: int64

#### 5) DataFrame 합치기

1. 새로운 col 또는 row 추가
2. col을 기준으로 데이터프레임 병합
3. row를 기준으로 데이터프레임 병합

In [84]:
df1 = pd.DataFrame({'A' : ['A0','A1','A2','A3'],
                    'B' : ['B0','B1','B2','B3'],
                    'C' : ['C0','C1','C2','C3'],
                    'D' : ['D0','D1','D2','D3']},
                    index = [0,1,2,3])

df2 = pd.DataFrame({'A' : ['A4','A5','A6','A7'],
                    'B' : ['B4','B5','B6','B7'],
                    'C' : ['C4','C5','C6','C7'],
                    'D' : ['D4','D5','D6','D7']},
                    index = [0,1,2,3])

In [85]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [86]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [87]:
pd.concat([df1,df2]) #행 단위로 붙임

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [88]:
pd.concat([df1,df2], axis = 1)

    A   B   C   D   A   B   C   D
0  A0  B0  C0  D0  A4  B4  C4  D4
1  A1  B1  C1  D1  A5  B5  C5  D5
2  A2  B2  C2  D2  A6  B6  C6  D6
3  A3  B3  C3  D3  A7  B7  C7  D7

In [92]:
df1['new'] = [1,2,3,4]
df1

    A   B   C   D  new
0  A0  B0  C0  D0    1
1  A1  B1  C1  D1    2
2  A2  B2  C2  D2    3
3  A3  B3  C3  D3    4

In [93]:
df1.drop('new', axis = 1) #세로축은 axis = 1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [94]:
df1 #다시 살아있음

    A   B   C   D  new
0  A0  B0  C0  D0    1
1  A1  B1  C1  D1    2
2  A2  B2  C2  D2    3
3  A3  B3  C3  D3    4

In [95]:
df1.drop('new', axis = 1, inplace=True) #inplace는 기존의 데이터프레임을 대체한다.

In [96]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3